<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [12]:
import pandas as pd
import psycopg2
import requests
from sqlalchemy import create_engine, exc, text
import urllib.parse as req
import xml.etree.ElementTree as ET

In [66]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [18]:
# connection = psycopg2.connect(
#     dbname=DBNAME,
#     user=USER,
#     host=HOST,
#     password=PASSWORD,
#     port=PORT
# )
try:  # попытка прочитать файл
    tree = ET.parse('con_str.xml') # читаем xml-файл
    root = tree.getroot()
    display('XML-файл обнаружен!')
except FileNotFoundError:  # если попытка не удалась
    display('Файл подключения к базе данных не найден!')  # выводим сообщение

try:  # попытка подключения к базе данных
    engine = create_engine(
        f'postgresql+psycopg2://{root[1].text}:{root[2].text}@{root[3].text}:{root[4].text}/{root[0].text}') # создаем строку подключения к базе данных
    connection = engine.connect()
    display('База данных подключена!')
except exc.SQLAlchemyError:  # если попытка не удалась
    display('Отсутствует подлкючение к базе данных!') # выводим сообщение

'XML-файл обнаружен!'

'База данных подключена!'

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [36]:
# текст запроса
query_3_1 = f'''
SELECT
  COUNT(1) AS "Количество вакансий" /*подсчет всех строк и назначение алиаса*/
FROM
  public.vacancies /*из таблицы вакансий*/
'''

In [49]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_3_1)).fetchall())
    display(df)  # выводим datafrane
except exc.SQLAlchemyError:  # если попытка не удалась
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий
0                49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [38]:
# текст запроса
query_3_2 = f'''
SELECT
  COUNT(1) AS "Количество работодателей" /*подсчет всех строк и назначение алиаса*/
FROM
  public.employers /*из таблицы работодателей*/
'''

In [50]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_3_2)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество работодателей
0                     23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [44]:
# текст запроса
query_3_3 = f'''
SELECT
  COUNT(1) AS "Количество регионов" /*подсчет всех строк и назначение алиаса*/
FROM
  public.areas /*из таблицы регионов*/
'''

In [51]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_3_3)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество регионов
0                 1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [52]:
# текст запроса
query_3_4 = f'''
SELECT
  COUNT(1) AS "Количество сфер деятельности" /*подсчет всех строк и назначение алиаса*/
FROM
  public.industries /*из таблицы со сферами деятельности*/
'''

In [53]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_3_4)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество сфер деятельности
0                           294

***

In [12]:
# выводы по предварительному анализу данных
# В базе данных сайта hh.ru находится 49197 вакансий от 23501 работодателя из 1362 регионов, представленных в 294 сферах деятельности

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [9]:
# текст запроса
query_4_1 = f'''
SELECT
  COUNT(1) AS "Количество вакансий", /*подсчет всех строк и назначение алиаса*/
  a.name AS "Регион" /*столбец с назаванием региона и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
  JOIN public.areas AS a ON v.area_id=a.id /*присоединение таблицы регионов по условию столбец с id-региона из таблицы вакансий равен столбцу с id из таблицы регионов и назначение алиаса*/
GROUP BY
  a.name /*группировка по столбцу с назаванием региона*/
ORDER BY
  COUNT(1) DESC /*сортировка в порядке убывания*/
LIMIT
  5 /*ограничение вывода пятью значениями, согласно заданию 4.1*/
'''

In [10]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_4_1)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий           Регион
0                 5333           Москва
1                 2851  Санкт-Петербург
2                 2112            Минск
3                 2006      Новосибирск
4                 1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [3]:
# текст запроса
query_4_2 = f'''
SELECT
  COUNT(1) AS "Количество вакансий" /*подсчет всех строк и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
WHERE
  (v.salary_from IS NOT NULL) /*при условии, что столбец зарплата от незаполнен*/
  OR (v.salary_to IS NOT NULL) /*или при условии, что столбец зарплата до незаполнен*/
'''

In [4]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_4_2)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий
0                24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [5]:
# текст запроса
query_4_3 = f'''
SELECT
  ROUND(AVG(v.salary_from)) AS "Среднее значение нижней границы", /*округленное до целого чмсла среднее значение столбца зарплата от и назначение алиаса*/
  ROUND(AVG(v.salary_to)) AS "Среднее значение верхней границы" /*округленное до целого чмсла среднее значение столбца зарплата до и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
'''

In [6]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_4_3)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

  Среднее значение нижней границы Среднее значение верхней границы
0                           71065                           110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [31]:
# текст запроса
query_4_4= f'''
SELECT
  COUNT(1) AS "Количество вакансий", /*подсчет всех строк и назначение алиаса*/
  v.schedule AS "Тип рабочего графика", /*столбец с типом рабочего графика и назначение алиаса*/
  v.employment AS "Тип трудоустройства" /*столбец с типом трудоустройства и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
GROUP BY
  v.schedule, /*группировка по столбцу с типом рабочего графика*/
  v.employment /*группировка по столбцу с типом трудоустройства*/
ORDER BY
  COUNT(1) DESC /*сортировка в порядке убывания*/
OFFSET
  1 /*ислючить из вывода первую строку*/
LIMIT
  1 /*вывести одно значение после первой строки, согласно заданию 4.4*/
'''

In [32]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_4_4)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий Тип рабочего графика Тип трудоустройства
0                 7802     Удаленная работа    Полная занятость

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [56]:
# текст запроса
query_4_5 = f'''
SELECT
  v.experience AS "Требуемый опыт работы" /*столбец с требуемым опытом работы и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
GROUP BY
  v.experience /*группировка по столбцу с требуемым опытом работы*/
ORDER BY
  COUNT(1) /*сортировка в порядке возрастания*/
'''

In [57]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_4_5)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

  Требуемый опыт работы
0           Более 6 лет
1             Нет опыта
2         От 3 до 6 лет
3    От 1 года до 3 лет

***

In [23]:
# выводы по детальному анализу вакансий
# Пятерка регионов по количеству вакансий: Москва, Санкт-Петербург, Минск, Новосибирск, Алматы
# Одно из двух полей с зарплатой заполнено у 24073 вакансий
# Среднее значение для нижней границы зарплатной вилки - 71065, а для верхней - 110537
# На втором месте по популярности среди всех вакансий по сочетанию типа рабочего графика и типа трудоустройства является Удалённая работа — Полная занятость
# Требуемый опыт работы в порядке возрастания количества вакансий составлет: Более 6 лет — Нет опыта — От 3 до 6 лет — От 1 года до 3 лет

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [77]:
# текст запроса
query_5_1 = f'''
(SELECT
  e.name "Работодатель" /*столбец с назаванием работодателя и назначение алиаса*/
FROM
  public.employers AS e /*из таблицы работодателей и назначение алиаса*/
  /*присоединение таблицы вакансий по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы вакансий и назначение алиаса*/
  JOIN public.vacancies AS v ON e.id=v.employer_id
GROUP BY
  e.name /*группировка по столбцу с назаванием работодателя*/
ORDER BY
  COUNT(1) DESC /*сортировка в порядке убывания*/
LIMIT
  1) /*ограничение вывода одним значением, согласно заданию 5.1*/
UNION /*соединение*/
(SELECT
  e.name "Работодатель" /*столбец с назаванием работодателя и назначение алиаса*/
FROM
  public.employers AS e /*из таблицы работодателей и назначение алиаса*/
  /*присоединение таблицы вакансий по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы вакансий и назначение алиаса*/
  JOIN public.vacancies AS v ON e.id=v.employer_id
GROUP BY
  e.name /*группировка по столбцу с назаванием работодателя*/
ORDER BY
  COUNT(1) DESC /*сортировка в порядке убывания*/
OFFSET
  4 /*ислючить из вывода четыре строки*/
LIMIT
  1) /*вывести одно значение после четвертой строки, согласно заданию 5.1*/
'''

In [78]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_5_1)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

    Работодатель
0  Газпром нефть
1         Яндекс

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [13]:
# текст запроса
query_5_2 = f'''
SELECT
  a.name AS "Регион", /*столбец с назаванием региона и назначение алиаса*/
  COUNT(DISTINCT e.id) AS "Количество работодателей", /*подсчет строк с исключением повторяющихся и назначение алиаса*/
  COUNT(DISTINCT v.id) AS "Количество вакансий" /*подсчет строк с исключением повторяющихся и назначение алиаса*/
FROM
  public.areas AS a /*из таблицы регионов и назначение алиаса*/
  /*присоединение таблицы работодателей слева по условию столбец с id из таблицы регионов равен столбцу региона из таблицы работодателей и назначение алиаса*/
  LEFT JOIN public.employers AS e ON a.id=e.area
  /*присоединение таблицы вакансий слева по условию столбец с id из таблицы регионов равен столбцу с id-региона из таблицы вакансий и назначение алиаса*/
  LEFT JOIN public.vacancies AS v ON a.id=v.area_id
WHERE
  v.id IS NULL /*условие, где столбец с id вакансий имеет значение null*/
GROUP BY
  a.name /*группировка по столбцу с назаванием региона*/
ORDER BY
  COUNT(e.id) DESC /*сортировка в порядке убывания*/
LIMIT
  1 /*ограничение вывода одним значением*/
'''

In [18]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_5_2)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Регион  Количество работодателей  Количество вакансий
0  Россия                       410                    0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [5]:
# текст запроса
query_5_3 = f'''
SELECT
  e.name AS "Работодатель", /*столбец с назаванием работодателя и назначение алиаса*/
  COUNT(DISTINCT v.area_id) AS "Количество регионов" /*подсчет строк с исключением повторяющихся и назначение алиаса*/
FROM
  public.employers AS e /*из таблицы работодателей и назначение алиаса*/
  /*присоединение таблицы вакансий слева по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы вакансий и назначение алиаса*/
  LEFT JOIN public.vacancies AS v ON e.id=v.employer_id
GROUP BY
  e.name /*группировка по столбцу с назаванием работодателя*/
ORDER BY
  COUNT(DISTINCT v.area_id) DESC /*сортировка в порядке убывания*/
LIMIT
  1 /*ограничение вывода одним значением*/
'''

In [17]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_5_3)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

  Работодатель  Количество регионов
0       Яндекс                  181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [7]:
# текст запроса
query_5_4 = f'''
SELECT
  COUNT(1) AS "Количество работодателей" /*подсчет всех строк и назначение алиаса*/
FROM
  public.employers AS e /*из таблицы работодателей и назначение алиаса*/
  /*присоединение таблицы employers_industries слева по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries и назначение алиаса*/
  LEFT JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
  /*присоединение таблицы сферы деятельности слева по условию столбец с id-сферы деятельности из таблицы employers_industries равен 
  столбцу с id из таблицы сферы деятельности и назначение алиаса*/
  LEFT JOIN public.industries AS i ON e_i.industry_id=i.id
WHERE
  i.id IS NULL /*условие, где столбец с id сферы деятельности имеет значение null*/
'''

In [8]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_5_4)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество работодателей
0                      8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [9]:
# текст запроса
query_5_5 = f'''
SELECT
  e.name AS "Название компании" /*столбец с назаванием работодателя и назначение алиаса*/
FROM
  public.employers AS e /*из таблицы работодателей и назначение алиаса*/
  /*присоединение таблицы employers_industries по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries и назначение алиаса*/
  JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
  /*присоединение таблицы сферы деятельности по условию столбец с id-сферы деятельности из таблицы employers_industries равен 
  столбцу с id из таблицы сферы деятельности и назначение алиаса*/
  JOIN public.industries AS i ON e_i.industry_id=i.id
GROUP BY
  e.name /*группировка по столбцу с назаванием работодателя*/
HAVING
  COUNT(i.id)=4 /*фильтруем сгруппированные данные, где количество сфер деятельности равно четырем*/
ORDER BY
  e.name /*сортировка в алфавитном порядке*/
OFFSET
  2 /*ислючить из вывода две строки*/
LIMIT
  1 /*вывести одно значение после второй строки, согласно заданию 5.5*/
'''

In [10]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_5_5)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

  Название компании
0              2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [40]:
# текст запроса
query_5_6 = f'''
SELECT
  COUNT(1) AS "Количество работодателей" /*подсчет всех строк и назначение алиаса*/
FROM
  public.employers AS e /*из таблицы работодателей и назначение алиаса*/
  /*присоединение таблицы employers_industries по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries и назначение алиаса*/
  JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
  /*присоединение таблицы сферы деятельности по условию столбец с id-сферы деятельности из таблицы employers_industries равен 
  столбцу с id из таблицы сферы деятельности и назначение алиаса*/
  JOIN public.industries AS i ON e_i.industry_id=i.id
WHERE
  i.name='Разработка программного обеспечения' /*условие, где столбец с названием сферы деятельности равен Разработка программного обеспечения*/
'''

In [41]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_5_6)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество работодателей
0                      3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [42]:
# код для получения списка городов-милионников
path_common = req.urlparse(
    'https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров')
url = path_common.scheme + '://' + req.quote(path_common.netloc) + req.quote(
    path_common.path) + '#' + req.quote(path_common.fragment)
# сохраняем список городов-миллионеров в переменную
cities = list(pd.read_html(url)[1]['Город'])
cities[13] = 'Воронеж'  # проводим корректировку названия города
cities = tuple(cities)  # сохраняем список в кортеж

In [43]:
# текст запроса
query_5_7 = f'''
SELECT
  a.name AS "Регионы-миллионники", /*столбец с названием региона и назначение алиаса*/
  COUNT(1) AS "Количество вакансий" /*подсчет всех строк и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
  /*присоединение таблицы areas (регионов) по условию столбец с id из таблицы регионов равен столбцу с id-региона из таблицы вакансий и назначение алиаса*/
  JOIN public.areas AS a ON a.id=v.area_id
  /*присоединение таблицы employers (работодателей) по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы вакансий и назначение алиаса*/
  JOIN public.employers AS e ON e.id=v.employer_id
WHERE
  e.name='Яндекс' /*условие, где название компании равно "Яндекс"*/
  AND a.name IN {cities} /*условие, где название региона входит в список городов-миллиоников*/
GROUP BY
  a.name /*группировка по столбцу с названием региона*/
UNION ALL /*объединение без повторений*/
SELECT
  'Total', /*нащначение алиаса*/ 
  COUNT(1) /*подсчет всех строк*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
  /*присоединение таблицы areas (регионов) по условию столбец с id из таблицы регионов равен столбцу с id-региона из таблицы вакансий и назначение алиаса*/
  JOIN public.areas AS a ON a.id=v.area_id
  /*присоединение таблицы employers (работодателей) по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы вакансий и назначение алиаса*/
  JOIN public.employers AS e ON e.id=v.employer_id
WHERE
  e.name='Яндекс' /*условие, где название компании равно "Яндекс"*/
  AND a.name IN {cities} /*условие, где название региона входит в список городов-миллиоников*/
'''

In [44]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_5_7)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Регионы-миллионники  Количество вакансий
0                Total                  485
1            Волгоград                   24
2              Воронеж                   32
3         Екатеринбург                   39
4               Казань                   25
5            Краснодар                   30
6           Красноярск                   23
7               Москва                   54
8      Нижний Новгород                   36
9          Новосибирск                   35
10                Омск                   21
11               Пермь                   25
12      Ростов-на-Дону                   25
13              Самара                   26
14     Санкт-Петербург                   42
15                 Уфа                   26
16           Челябинск                   22

***

In [ ]:
# выводы по анализу работодателей
# Пятерку компанй по количеству вакансий составляют: Яндекс, Ростелеком, Тинькофф, СБЕР и Газпром нефть
# Регионом с наибольшим количеством работодателей является Россия
# Вакансии компании Яндекс представлены в 181 регионе
# У 8419 работодателей не указана сфера деятельности
# Тройку компаний, у которых указано четыре сферы деятельности составляют: 101 Интернет, 21vek.by и 2ГИС
# У 3553 работодателей в качетсве сферы деятельности указана Разработка программного обеспечения
# 485 вакансий компании Яндекс представлены в 16 городах-миллионниках России

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [45]:
# текст запроса
query_6_1 = f'''
SELECT
  COUNT(1) AS "Количество вакансий" /*подсчет всех строк и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
WHERE
  (LOWER(v.name) LIKE '%data%') /*условие, где в названии вакансии встречается "data", написанное с маленькой буквы*/
  OR (LOWER(v.name) LIKE '%данн%') /*условие, где в названии вакансии встречается "данн", написанное с маленькой буквы*/
'''

In [46]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_6_1)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий
0                 1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [51]:
# текст запроса
query_6_2 = f'''
SELECT
  COUNT(1) AS "Количество вакансий" /*подсчет всех строк и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
WHERE
  (
    (LOWER(v.name) LIKE '%data scientist%') /*условие, где в названии вакансии встречается "data scientist", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%data science%') /*условие, где в названии вакансии встречается "data science", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%исследователь данных%') /*условие, где в названии вакансии встречается "исследователь данных", написанное с маленькой буквы*/
    OR (
      v.name LIKE '%ML%' /*условие, где в названии вакансии встречается "ML"*/
      AND v.name NOT LIKE '%HTML%' /*условие, где в названии вакансии не встречается "HTML"*/
    )
    OR (LOWER(v.name) LIKE '%machine learning%') /*условие, где в названии вакансии встречается "machine learning", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%машинн%обучен%') /*условие, где в названии вакансии встречается "машинн обучен", написанное с маленькой буквы*/
  )
  AND (
    (LOWER(v.name) LIKE '%junior%') /*условие, где в названии вакансии встречается "junior", написанное с маленькой буквы*/
    OR (v.experience='Нет опыта') /*условие, где опыт равен "Нет опыта"*/
    OR (v.schedule='Стажировка') /*условие. где тип трудоустройства равен "Стажировка"*/
  )
'''

In [52]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_6_2)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий
0                   51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [3]:
# текст запроса
query_6_3 = f'''
SELECT
  COUNT(1) AS "Количество вакансий" /*подсчет всех строк и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
WHERE
  (
    (LOWER(v.name) LIKE '%data scientist%') /*условие, где в названии вакансии встречается "data scientist", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%data science%') /*условие, где в названии вакансии встречается "data science", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%исследователь данных%') /*условие, где в названии вакансии встречается "исследователь данных", написанное с маленькой буквы*/
    OR (
      v.name LIKE '%ML%' /*условие, где в названии вакансии встречается "ML"*/
      AND v.name NOT LIKE '%HTML%' /*условие, где в названии вакансии не встречается "HTML"*/
    )
    OR (LOWER(v.name) LIKE '%machine learning%') /*условие, где в названии вакансии встречается "machine learning", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%машинн%обучен%') /*условие, где в названии вакансии встречается "машинн обучен", написанное с маленькой буквы*/
  )
  AND (
    (LOWER(v.key_skills) LIKE '%sql%') /*условие, где в качестве названии ключевых навыков встречается "sql", написанное с маленькой буквы*/
    OR (LOWER(v.key_skills) LIKE '%postgres%') /*условие, где в качестве названии ключевых навыков встречается "postgres", написанное с маленькой буквы*/
  )
'''

In [4]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_6_3)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий
0                  201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [5]:
# текст запроса
query_6_4 = f'''
SELECT
  COUNT(1) AS "Количество вакансий" /*подсчет всех строк и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
WHERE
  (
    (LOWER(v.name) LIKE '%data scientist%') /*условие, где в названии вакансии встречается "data scientist", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%data science%') /*условие, где в названии вакансии встречается "data science", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%исследователь данных%') /*условие, где в названии вакансии встречается "исследователь данных", написанное с маленькой буквы*/
    OR (
      v.name LIKE '%ML%' /*условие, где в названии вакансии встречается "ML"*/
      AND v.name NOT LIKE '%HTML%' /*условие, где в названии вакансии не встречается "HTML"*/
    )
    OR (LOWER(v.name) LIKE '%machine learning%') /*условие, где в названии вакансии встречается "machine learning", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%машинн%обучен%') /*условие, где в названии вакансии встречается "машинн обучен", написанное с маленькой буквы*/
  )
  AND (LOWER(v.key_skills) LIKE '%python%') /*условие, где в качестве названии ключевых навыков встречается "python", написанное с маленькой буквы*/
'''

In [6]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_6_4)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий
0                  351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [7]:
# текст запроса
query_6_5 = f'''
SELECT
  ROUND(
    AVG(
      LENGTH (v.key_skills)-LENGTH (REPLACE (v.key_skills, chr (9), ''))+1
    ),
    2
  ) AS "Среднее количество" /*округление до двух знаков после запятой, вычисление среднего и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
WHERE
  (
    (LOWER(v.name) LIKE '%data scientist%') /*условие, где в названии вакансии встречается "data scientist", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%data science%') /*условие, где в названии вакансии встречается "data science", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%исследователь данных%') /*условие, где в названии вакансии встречается "исследователь данных", написанное с маленькой буквы*/
    OR (
      v.name LIKE '%ML%' /*условие, где в названии вакансии встречается "ML"*/
      AND v.name NOT LIKE '%HTML%' /*условие, где в названии вакансии не встречается "HTML"*/
    )
    OR (LOWER(v.name) LIKE '%machine learning%') /*условие, где в названии вакансии встречается "machine learning", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%машинн%обучен%') /*условие, где в названии вакансии встречается "машинн обучен", написанное с маленькой буквы*/
  )
  AND (v.key_skills IS NOT NULL) /*условие, где столбец с ключевыми навыками не пустой*/
'''

In [8]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_6_5)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

  Среднее количество
0               6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [9]:
# текст запроса
query_6_6 = f'''
SELECT
  v.experience "Требуемый опыт", /*столбец с опытом работы и назначение алиаса*/
  ROUND(
    AVG(
      (
        COALESCE(v.salary_from, v.salary_to)+COALESCE(v.salary_to, v.salary_from)
      )/2
    )
  ) AS "Средняя зарплата" /*округление, вычисление среднего с заменой пустых значений и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
WHERE
  (
    (LOWER(v.name) LIKE '%data scientist%') /*условие, где в названии вакансии встречается "data scientist", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%data science%') /*условие, где в названии вакансии встречается "data science", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%исследователь данных%') /*условие, где в названии вакансии встречается "исследователь данных", написанное с маленькой буквы*/
    OR (
      v.name LIKE '%ML%' /*условие, где в названии вакансии встречается "ML"*/
      AND v.name NOT LIKE '%HTML%' /*условие, где в названии вакансии не встречается "HTML"*/
    )
    OR (LOWER(v.name) LIKE '%machine learning%') /*условие, где в названии вакансии встречается "machine learning", написанное с маленькой буквы*/
    OR (LOWER(v.name) LIKE '%машинн%обучен%') /*условие, где в названии вакансии встречается "машинн обучен", написанное с маленькой буквы*/
  )
  AND (
    (v.salary_from IS NOT NULL) /*условие, где столбец с зарплатой от не пустой*/
    OR (v.salary_to IS NOT NULL) /*условие, где столбец с зарплатой до не пустой*/
  )
GROUP BY
  v.experience /*группировка по столбцу с опытом работы*/
'''

In [10]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_6_6)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

       Требуемый опыт Средняя зарплата
0           Нет опыта            74643
1  От 1 года до 3 лет           139675
2       От 3 до 6 лет           243115

***

In [ ]:
# выводы по предметному анализу
# В базе находится 1771 вакансия имеющая отношения к данным
# Для начинающего дата-сайентиста подходит 51 вакансия
# В качестве ключевых навыков в 201 вакансии для DS указаны SQL или Postgres
# В требованиях работодателей к DS Python указан в 351 вакансии
# Среднее количество ключевых навыков в вакансиях для DS составляет 6,41
# Средняя зарплата указанная в вакансиях для DS составляет: Нет опыта - 74643, От 1 года до 3 лет - 139675 и От 3 до 6 лет - 243115

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# Из 49197 вакансий 1771 имеет отношения к данным и 51 вакансия подходит для начинающего дата-сайентиста
# Из 23501 работодателя пятерку компаний по количеству вакансий составляют: Яндекс, Ростелеком, Тинькофф, СБЕР и Газпром нефть
# Из 1362 регионов пятерку регионов по количеству вакансий составляют: Москва, Санкт-Петербург, Минск, Новосибирск, Алматы
# Из 24073 вакансий, где заполнено одно из двух полей с зарплатой, среднее значение для нижней границы зарплатной вилки - 71065, а для верхней - 110537
# Среди всех вакансий по популярности и сочетанию типа рабочего графика, а также типа трудоустройства является: Полный день, Удаленная работа и Полная занятость
# Среди всех вакансий в порядке возрастания их количества по требуемому опыту работы является: Более 6 лет — Нет опыта — От 3 до 6 лет — От 1 года до 3 лет
# Среди всех регионов по наибольшему количеству вакансий является Россия, а 485 вакансий компании Яндекс представлены в 181 регионе и в 16 городах-миллионниках России
# Из всех представленных на сайте работодателей у 8419 не указана их сфера деятельности, а тройку компаний, у которых указано четыре сферы деятельности составляют: 101 Интернет, 21vek.by и 2ГИС
# Из всех представленных на сайте работодателей у 3553 работодателей в качетсве сферы деятельности указана Разработка программного обеспечения

# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

# Дополнительные исследования данных
1. Узнаем пятёрку лидеров в сферах деятельности по количеству вакансий

In [6]:
# текст запроса
query_bonus_1 = f'''
SELECT
  COUNT(1) AS "Количество вакансий", /*подсчет всех строк и назначение алиаса*/
  i.name AS "Сфера деятельности" /*столбец с названием сферы деятельности и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
  /*присоединение таблицы employers (работодателей) по условию столбец с id-работодателя из таблицы вакансий равен столбцу с id из таблицы работодателей*/
  JOIN public.employers AS e ON v.employer_id=e.id
  /*присоединение таблицы employers_industries по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries*/
  JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
  /*присоединение таблицы industries (сфера деятельности) по условию id-сферы деятельности из таблицы employers_industries равен столбцу с id из таблицы сфер деятельности*/
  JOIN public.industries AS i ON e_i.industry_id=i.id
GROUP BY
  i.name /*группировка по столбцу с насзвание сфер деятельности*/
ORDER BY
  COUNT(1) DESC /*сортировка по убыванию*/
LIMIT
  5 /*ограничение вывода пятью значениями*/
'''

In [7]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_bonus_1)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий                                 Сфера деятельности
0                12499                Разработка программного обеспечения
1                11034  Системная интеграция,  автоматизации технологи...
2                 6413  Интернет-компания (поисковики, платежные систе...
3                 2742                                               Банк
4                 1585                                    Мобильная связь

2. Узнаем пятёрку лидеров регионов по количеству вакансий, где сферами деятельности являются самые распространенные из них, с количеством более 10000 вакансий

In [19]:
# текст запроса
query_bonus_2 = f'''
SELECT
  COUNT(1) AS "Количество вакансий", /*подсчет всех строк и назначение алиаса*/
  a.name AS "Регион" /*столбец с названием региона и назначение алиаса*/
FROM
  public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
  /*присоединение таблицы employers (работодателей) по условию столбец с id-работодателя из таблицы вакансий равен столбцу с id из таблицы работодателей*/
  JOIN public.employers AS e ON v.employer_id=e.id
  /*присоединение таблицы employers_industries по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries*/
  JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
  /*присоединение таблицы industries (сфера деятельности) по условию столбец с id-сферы деятельности из таблицы employers_industries равен столбцу с id из таблицы сфер деятельности*/
  JOIN public.industries AS i ON e_i.industry_id=i.id
  /*присоединение таблицы areas (регионы) по условию столбец id-региона из таблицы вакансий равен столбцу с id из таблицы регонов*/
  JOIN public.areas AS a ON v.area_id=a.id
WHERE
  i.name IN (
    SELECT
      i.name AS "Сфера деятельности" /*столбец с названием сферы деятельности и назначение алиаса*/
    FROM
      public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
      /*присоединение таблицы employers (работодателей) по условию столбец с id-работодателя из таблицы вакансий равен столбцу с id из таблицы работодателей*/
      JOIN public.employers AS e ON v.employer_id=e.id
      /*присоединение таблицы employers_industries по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries*/
      JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
      /*присоединение таблицы industries (сфера деятельности) по условию id-сферы деятельности из таблицы employers_industries равен столбцу с id из таблицы сфер деятельности*/
      JOIN public.industries AS i ON e_i.industry_id=i.id
    GROUP BY
      i.name /*группировка по столбцу с насзвание сфер деятельности*/
    HAVING
      COUNT(1)>10000 /*фильтруем сгруппированные данные, где количество вакансий больше десяти тысяч*/
    ORDER BY
      COUNT(1) DESC /*сортировка по убыванию*/
  ) /*условие, где названия сфер деятельности входит в список результатов вывода подзапроса*/
GROUP BY
  a.name /*группировка по названию региона*/
ORDER BY
  COUNT(1) DESC /*сортировка по убыванию*/
LIMIT
  5 /*ограничение вывода пятью значениями*/
'''

In [20]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_bonus_2)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

   Количество вакансий           Регион
0                 2411           Москва
1                 1587  Санкт-Петербург
2                 1540            Минск
3                 1056      Новосибирск
4                 1009           Алматы

3. Согласно полученному списку регионов, видно, что результат выполнения запроса полностью совпадает с результатом, получившимся в задании 4.1, поэтому посчитаем соотношение в процентах количества вакансий, где сферами деятельности являются самые распространенные из них, по количеству более 10000 вакансий и их общего количества в данных регионах

In [21]:
# текст запроса
query_bonus_3 = f'''
SELECT
  ROUND((SUM(bonus."Количество вакансий")/SUM(task."Количество вакансий"))*100)::TEXT||'%' "Соотношение", bonus."Регион"
FROM (
  SELECT
    COUNT(1) AS "Количество вакансий", /*подсчет всех строк и назначение алиаса*/
    a.name AS "Регион" /*столбец с названием региона и назначение алиаса*/
  FROM
    public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
    /*присоединение таблицы employers (работодателей) по условию столбец с id-работодателя из таблицы вакансий равен столбцу с id из таблицы работодателей*/
    JOIN public.employers AS e ON v.employer_id=e.id
    /*присоединение таблицы employers_industries по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries*/
    JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
    /*присоединение таблицы industries (сфера деятельности) по условию столбец с id-сферы деятельности из таблицы employers_industries равен столбцу с id из таблицы сфер деятельности*/
    JOIN public.industries AS i ON e_i.industry_id=i.id
    /*присоединение таблицы areas (регионы) по условию столбец id-региона из таблицы вакансий равен столбцу с id из таблицы регонов*/
    JOIN public.areas AS a ON v.area_id=a.id
  WHERE
    i.name IN (
      SELECT
        i.name AS "Сфера деятельности" /*столбец с названием сферы деятельности и назначение алиаса*/
      FROM
        public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
        /*присоединение таблицы employers (работодателей) по условию столбец с id-работодателя из таблицы вакансий равен столбцу с id из таблицы работодателей*/
        JOIN public.employers AS e ON v.employer_id=e.id
        /*присоединение таблицы employers_industries по условию столбец с id из таблицы работодателей равен столбцу с id-работодателя из таблицы employers_industries*/
        JOIN public.employers_industries AS e_i ON e.id=e_i.employer_id
        /*присоединение таблицы industries (сфера деятельности) по условию id-сферы деятельности из таблицы employers_industries равен столбцу с id из таблицы сфер деятельности*/
        JOIN public.industries AS i ON e_i.industry_id=i.id
      GROUP BY
        i.name /*группировка по столбцу с насзвание сфер деятельности*/
      HAVING
        COUNT(1)>10000 /*фильтруем сгруппированные данные, где количество вакансий больше десяти тысяч*/
      ORDER BY
        COUNT(1) DESC /*сортировка по убыванию*/
  ) /*условие, где названия сфер деятельности входит в список результатов вывода подзапроса*/
  GROUP BY
    a.name /*группировка по названию региона*/
  ORDER BY
    COUNT(1) DESC /*сортировка по убыванию*/
  LIMIT
    5 /*ограничение вывода пятью значениями*/
) bonus
JOIN (
  SELECT
    COUNT(1) AS "Количество вакансий", /*подсчет всех строк и назначение алиаса*/
    a.name AS "Регион" /*столбец с назаванием региона и назначение алиаса*/
  FROM
    public.vacancies AS v /*из таблицы вакансий и назначение алиаса*/
    JOIN public.areas AS a ON v.area_id=a.id /*присоединение таблицы регионов по условию столбец с id-региона из таблицы вакансий равен столбцу с id из таблицы регионов и назначение алиаса*/
  GROUP BY
    a.name /*группировка по столбцу с назаванием региона*/
  ORDER BY
    COUNT(1) DESC /*сортировка в порядке убывания*/
  LIMIT
    5 /*ограничение вывода пятью значениями, согласно заданию 4.1*/
) task ON bonus."Регион"=task."Регион"
GROUP BY
  bonus."Регион"
ORDER BY
  "Соотношение"
'''

In [22]:
# результат запроса
try:  # попытка выполнить запрос
    # сохраняем в dataframe
    df = pd.DataFrame(connection.execute(text(query_bonus_3)).fetchall())
    display(df)  # выводим dataframe
except exc.SQLAlchemyError:  # если не получилось выполнить запрос
    display('Запрос к базе данных не выполнен!')  # выводим сообщение

  Соотношение           Регион
0         45%           Москва
1         53%           Алматы
2         53%      Новосибирск
3         56%  Санкт-Петербург
4         73%            Минск

In [ ]:
# подведем итог дополнительного исследования данных
# Самыми распространенными сферами деятельности по количеству вакансий являются:
# "Разработка программного обеспечения" и "Системная интеграция, автоматизации технологических и бизнес-процессов предприятия, ИТ-консалтинг" более 10000 вакансий,
# Интернет-компания (поисковики, платежные системы, соц.сети, информационно-познавательные и развлекательные ресурсы, продвижение сайтов и прочее) от 6000 до 6500 вакансий,
# Банк от 2500 до 3000 вакансий,
# Мобильная связь от 1500 до 2000 вакансий
# Пятёрку регионов как по самыми распространенными сферам деятельности (более 10000), так и по общему количеству вакансий составляют: Москва, Санкт-Петербург, Минск, Новосибирск и Алматы
# Процентное соотношение по количеству вакансий с вышеперечисленными сферами деятельности к общему количеству вакансий в первых пяти регионах составляет: 
# Москва - 45%, Алматы и Новосибирск - 53%, Санкт-Петербург - 56% и Минск - 73%